src/Documents/Scan_ЗаявкаНаКомплектующие/Scan_ЗаявкаНаКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаКомплектующие</name>
  <comment>Заявка на комплектующие (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаКомплектующие</basedOn>
  <registerRecords>AccumulationRegister.Scan_ДвиженияКомплектующих</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Scan_СтатусыЗаявокНаКомплектующие</types>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаКомплектующие</types>
    </type>
  </attributes>
  <attributes>
    <name>NumDocExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТребуемое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/Scan_СтатусыЗаявокНаКомплектующие/Scan_СтатусыЗаявокНаКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_СтатусыЗаявокНаКомплектующие</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноИсполнена</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Scan_ЗаявкаНаКомплектующие/Forms/ФормаСписка/Module.bsl
//rarus tenkam 30.11.2017 mantis 11952 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаПечать;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаявкаИсполнена(Команда)
	
	МассивВыбранныхСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Сообщить("Не выбран ни один документ");                                                                       
		Возврат;
	ИначеЕсли МассивВыбранныхСтрок.Количество() > 1 Тогда
		Сообщить("Выберите один документ");                            
	Иначе
		Если НЕ ДокументПроведен(МассивВыбранныхСтрок[0]) Тогда
			Сообщить("Документ не проведен!");
			Возврат;
		КонецЕсли;
		Если НЕ ЭтоСписаниеСЦС(МассивВыбранныхСтрок[0]) Тогда
			Сообщить("Нельзя создать поступление комлектующих на основании документа с ХО ""Заказ на ЦС""!");
			Возврат;
		КонецЕсли;
		
		//12.02.2018 +++
		Если ПолучитьСтатус(МассивВыбранныхСтрок[0]) = ПредопределенноеЗначение("Перечисление.Scan_СтатусыЗаявокНаКомплектующие.Исполнена") Тогда
			Сообщить("Заявка уже исполнена!");
			Возврат;
		КонецЕсли;
		//12.02.2018 ---   
		
		ПараметрыОткрытия = Новый Структура("ДокументОснование", МассивВыбранныхСтрок[0]);
		ПараметрыОткрытия.Вставить("ИсполненаПолностью", Истина);
		Оповещение = Новый ОписаниеОповещения("ВводНакладнойСоздание", ЭтотОбъект);
		ОткрытьФорму("Документ.Scan_ЗаявкаНаКомплектующие.Форма.ФормаВводНакладной",ПараметрыОткрытия,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаявкаИсполненаНеПолностью(Команда)
	МассивВыбранныхСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Сообщить("Не выбран ни один документ");                                                                       
		Возврат;
	ИначеЕсли МассивВыбранныхСтрок.Количество() > 1 Тогда
		Сообщить("Выберите один документ");                            
	Иначе
		Если НЕ ДокументПроведен(МассивВыбранныхСтрок[0]) Тогда
			Сообщить("Документ не проведен!");
			Возврат;
		КонецЕсли;
		Если НЕ ЭтоСписаниеСЦС(МассивВыбранныхСтрок[0]) Тогда
			Сообщить("Нельзя создать поступление комлектующих на основании документа с ХО ""Заказ на ЦС""!");
			Возврат;
		КонецЕсли;  
		
		//12.02.2018 +++
		Если ПолучитьСтатус(МассивВыбранныхСтрок[0]) = ПредопределенноеЗначение("Перечисление.Scan_СтатусыЗаявокНаКомплектующие.Исполнена") Тогда
			Сообщить("Заявка уже исполнена!");
			Возврат;
		КонецЕсли;
		//12.02.2018 ---
		
		ПараметрыОткрытия = Новый Структура("ДокументОснование", МассивВыбранныхСтрок[0]);
		ПараметрыОткрытия.Вставить("ИсполненаПолностью", Ложь);
		Оповещение = Новый ОписаниеОповещения("ВводНакладнойСоздание", ЭтотОбъект);
		ОткрытьФорму("Документ.Scan_ЗаявкаНаКомплектующие.Форма.ФормаВводНакладной",ПараметрыОткрытия,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ВводНакладнойСоздание(ВозвращаемыеЗначения, ДополнительныеПараметры) Экспорт
	Если ВозвращаемыеЗначения <> Неопределено Тогда
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Создан и проведен документ " + ВозвращаемыеЗначения);
		Сообщить(НСтр("ru = 'Создан и проведен документ '; en = 'Document saved '") + ВозвращаемыеЗначения);
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---  	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументПроведен(ДокСсылка)
	Возврат ДокСсылка.Проведен;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоСписаниеСЦС(ДокСсылка)
	Возврат ДокСсылка.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СписаниеСЦС;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатус(ДокСсылка)
	Возврат ДокСсылка.Статус;
КонецФункции

//rarus tenkam 30.11.2017 mantis 11952 ---

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти
